#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_role.ecs_task_execution_role: Reading...
aws_eip.nat_1: Refreshing state... [id=eipalloc-00414a50017e479a8]
aws_eip.nat_2: Refreshing state... [id=eipalloc-063d1241389fbdbfa]
aws_vpc.main: Refreshing state... [id=vpc-07875707521c30620]
aws_efs_file_system.shared_storage: Refreshing state... [id=fs-0f478b3d4b9a02ce4]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:cluster/main]
aws_subnet.reverse_proxy_2: Refreshing state... [id=subnet-02dce6fccf468d75f]
aws_subnet.wordpress_2: Refreshing state... [id=subnet-0ed370ee4266b80e7]
aws_subnet.wordpress_1: Refreshing state... [id=subnet-039350281fbe8abf9]
aws_subnet.public_2: Refreshing state... [id=subnet-0d46008d631cc18e5]
aws_subnet.reverse_proxy_1: Refreshing state... [id=subnet-0716901fe27fd7512]
aws_security_group.efs_sg: Refreshing state... [id=sg-0175af82259da2737]
aws_lb_target_group.reverse_proxy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/036f5fdc96c8cdd0]
aws_security_group.alb_sg: Refreshing state... [id=sg-0f6c5ed3112b55269]
aws_security_group.aurora_sg: Refreshing state... [id=sg-02f015e760b3cb2c6]
aws_internet_gateway.gw: Refreshing state... [id=igw-0c345add3847c2290]
aws_subnet.public_1: Refreshing state... [id=subnet-07342c785f65a9e00]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-066308d3daabe2ea3]
aws_efs_mount_target.wordpress_2: Refreshing state... [id=fsmt-0574625fa41402f78]
aws_db_subnet_group.wordpress: Refreshing state... [id=wordpress]
aws_efs_mount_target.reverse_proxy_1: Refreshing state... [id=fsmt-074e81398d50c6a7c]
aws_security_group.reverse_proxy_sg: Refreshing state... [id=sg-07d2c378d1e603dae]
aws_lb.reverse_proxy_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:loadbalancer/app/reverse-proxy-alb/d091256b13a919c1]
aws_route_table.private_2: Refreshing state... [id=rtb-0291b8edc93a2ab6a]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-0fc6b925ac93f5c8e]
aws_route_table_association.wordpress_private_2: Refreshing state... [id=rtbassoc-050e75ea4551c04a9]
aws_route_table_association.reverse_proxy_private_2: Refreshing state... [id=rtbassoc-05c1ad967c29bcf2e]
aws_security_group.wordpress_sg: Refreshing state... [id=sg-05d8ae170ab9a456f]
aws_route_table.private_1: Refreshing state... [id=rtb-0a470d52cb807f866]
aws_route_table_association.wordpress_private_1: Refreshing state... [id=rtbassoc-09083667f410cb4bc]
aws_route_table_association.reverse_proxy_private_1: Refreshing state... [id=rtbassoc-097d2991f3df3b04c]
aws_lb_listener.reverse_proxy_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:listener/app/reverse-proxy-alb/d091256b13a919c1/c36c504d569e7837]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_efs_mount_target.reverse_proxy_2 will be created
  + resource "aws_efs_mount_target" "reverse_proxy_2" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-0f478b3d4b9a02ce4"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0175af82259da2737",
        ]
      + subnet_id              = "subnet-02dce6fccf468d75f"
    }

  # aws_efs_mount_target.wordpress_1 will be created
  + resource "aws_efs_mount_target" "wordpress_1" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = "fs-0f478b3d4b9a02ce4"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-0175af82259da2737",
        ]
      + subnet_id              = "subnet-039350281fbe8abf9"
    }

  # aws_rds_cluster.wordpress will be created
  + resource "aws_rds_cluster" "wordpress" {
      + allocated_storage                     = (known after apply)
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + availability_zones                    = (known after apply)
      + backup_retention_period               = (known after apply)
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier                    = "wordpress"
      + cluster_identifier_prefix             = (known after apply)
      + cluster_members                       = (known after apply)
      + cluster_resource_id                   = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_name                         = "wordpress"
      + db_cluster_parameter_group_name       = (known after apply)
      + db_subnet_group_name                  = "wordpress"
      + db_system_id                          = (known after apply)
      + delete_automated_backups              = true
      + enable_global_write_forwarding        = false
      + enable_http_endpoint                  = false
      + enable_local_write_forwarding         = false
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_mode                           = "provisioned"
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_roles                             = (known after apply)
      + id                                    = (known after apply)
      + kms_key_id                            = (known after apply)
      + master_password                       = (sensitive value)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + master_username                       = "admin"
      + network_type                          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + reader_endpoint                       = (known after apply)
      + skip_final_snapshot                   = false
      + storage_encrypted                     = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + vpc_security_group_ids                = [
          + "sg-02f015e760b3cb2c6",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @ravenoak, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*